In [6]:
x = [1,3,2,5,6,4,3,8,12,5]

In [7]:
[x for x in x[1::2] if x%2==0]

[4, 8]

In [11]:
df=pd.DataFrame({"code":[10,22,13,21,12,11,17],"city":["g",None,"m","d",None,"d","m"]})

In [12]:
pd.DataFrame(df.fillna("k").groupby("city").min().T)

city   d   g   k   m
code  11  10  12  13

In [24]:
import numpy as np
import pandas as pd

In [2]:
a =pd.Series([0])
b =pd.Series([1])

In [4]:
d =[]
for i ,j in zip(a,b):
    d.append((i+j)/2)

In [5]:
d

[0.5]

In [13]:
n = ["IXO","KOLKATA","SALT LAKE","SEZ"]

In [14]:
n[-2][-2]

'K'

In [15]:
s1 = "KOLKATA"
s2 = "LAKE"

In [16]:
e = list(set(s1)&set(s2))

In [17]:
for i in e:
    print(i)

A
L
K

In [49]:

df = pd.DataFrame({"x":[1,2,3],"y":[4,5,6]})

In [41]:
# df = df.apply(lambda x:list(x),axis=1)

In [58]:
df.columns.max().index

In [82]:
df

   x  y
0  1  4
1  2  5
2  3  6

In [85]:
for i in list(df.columns):
    print(f" {i} {df[i].max()}")

 x 3
 y 6

In [72]:
t = 0
def foo():
#     t+=1
    return t+1

In [73]:
foo()

1